import os
with open("E:\\DosBoxDriver\\asm\\Documentillustration.txt",'w+')as p:
    p.write("------------------------请使用 Notepad++打开，勿使用记事本打开--------------------------------|\n")
    p.write("----------------------------------------------------------------------------------------------|\n")
    p.write("----------------------------------------------------------------------------------------------|\n")
    p.write("--------- 文件名 -------------|------------------------文件说明 ------------------------------|\n")
    
    for file in os.listdir('E:\\DosBoxDriver\\asm\\'):
        if "ocum" in file:
            continue
        print(file + " " * (30 - len(file)) +"|" + " "*63 + "|"  +"\n" )
        p.write(file + " " * (30 - len(file)) +"|" + " "*63 + "|"  +"\n" )
    
print("完成")
